# RiserIntWithBoundaryMoreThanOnceFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RiserIntWithBoundaryMoreThanOnceFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Riser intersects with boundary more than once.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RiserIntWithBoundaryMoreThanOnceFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RiserIntWithBoundaryMoreThanOnceFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RiserIntWithBoundaryMoreThanOnceFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace